src/AccumulationRegisters/ЗаказыКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыКлиентов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ТоварыВРезерве.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРезерве</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/СтатусыЗаказовКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказовКлиентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОтгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаказКлиента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаказыКлиентов</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезерве</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/CommonModules/ЗаказыКлиентовСервер/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Заказы клиентов: остатки к отгрузке, контроль отгрузки, закрытие просроченных заказов.
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает неотгруженный остаток заказа по регистру ЗаказыКлиентов.
//
// Параметры:
//  ЗаказКлиента - ДокументСсылка.ЗаказКлиента - заказ.
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки Номенклатура, Количество, Сумма; только строки с положительным остатком.
//
Функция ОстаткиКОтгрузке(ЗаказКлиента) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказыОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыОстатки.КоличествоОстаток КАК Количество,
	|	ЗаказыОстатки.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.ЗаказыКлиентов.Остатки(, ЗаказКлиента = &ЗаказКлиента) КАК ЗаказыОстатки
	|ГДЕ
	|	ЗаказыОстатки.КоличествоОстаток > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказыОстатки.Номенклатура.Наименование";

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Проверяет, что по заказу не отгружено больше, чем заказано, и резерв не ушел в минус.
// Вызывается после записи движений реализации и самого заказа.
//
// Параметры:
//  ЗаказКлиента - ДокументСсылка.ЗаказКлиента - проверяемый заказ.
//  Документ - ДокументСсылка - документ, к которому привязываются сообщения.
//  Отказ - Булево - устанавливается в Истина при нарушении.
//
Процедура ПроверитьОстаткиПоЗаказу(ЗаказКлиента, Документ, Отказ) Экспорт

	Если Не ЗначениеЗаполнено(ЗаказКлиента) Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказыОстатки.Номенклатура КАК Номенклатура,
	|	-ЗаказыОстатки.КоличествоОстаток КАК Превышение
	|ИЗ
	|	РегистрНакопления.ЗаказыКлиентов.Остатки(, ЗаказКлиента = &ЗаказКлиента) КАК ЗаказыОстатки
	|ГДЕ
	|	ЗаказыОстатки.КоличествоОстаток < 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РезервОстатки.Номенклатура КАК Номенклатура,
	|	-РезервОстатки.КоличествоОстаток КАК Превышение
	|ИЗ
	|	РегистрНакопления.ТоварыВРезерве.Остатки(, ЗаказКлиента = &ЗаказКлиента) КАК РезервОстатки
	|ГДЕ
	|	РезервОстатки.КоличествоОстаток < 0";

	Результаты = Запрос.ВыполнитьПакет();

	Выборка = Результаты[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон(НСтр("ru = 'По заказу %1 товар «%2» отгружен сверх заказанного на %3'"),
				ЗаказКлиента, Выборка.Номенклатура,
				ОбщегоНазначенияКлиентСервер.ПредставлениеКоличества(Выборка.Превышение)),
			Документ, , , Отказ);
	КонецЦикла;

	Выборка = Результаты[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон(НСтр("ru = 'По заказу %1 товар «%2»: количество в заказе меньше уже отгруженного на %3'"),
				ЗаказКлиента, Выборка.Номенклатура,
				ОбщегоНазначенияКлиентСервер.ПредставлениеКоличества(Выборка.Превышение)),
			Документ, , , Отказ);
	КонецЦикла;

КонецПроцедуры

// Закрывает заказы в статусе «К отгрузке», у которых дата отгрузки просрочена больше чем на
// СрокРезервированияДней. Закрытие снимает неиспользованный резерв и неотгруженный остаток.
// Каждый заказ закрывается в своей транзакции: ошибка одного не мешает остальным.
//
// Возвращаемое значение:
//  Структура:
//   * Закрыто - Число - сколько заказов закрыто.
//   * Ошибок - Число - сколько заказов закрыть не удалось (подробности - в журнале регистрации).
//
Функция ЗакрытьПросроченныеЗаказы() Экспорт

	Результат = Новый Структура("Закрыто, Ошибок", 0, 0);

	СрокДней = Константы.СрокРезервированияДней.Получить();
	ГраницаПросрочки = НачалоДня(ТекущаяДатаСеанса()) - СрокДней * 86400;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГраницаПросрочки", ГраницаПросрочки);
	Запрос.УстановитьПараметр("КОтгрузке", Перечисления.СтатусыЗаказовКлиентов.КОтгрузке);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Проведен
	|	И ЗаказКлиента.Статус = &КОтгрузке
	|	И ЗаказКлиента.ДатаОтгрузки < &ГраницаПросрочки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказКлиента.МоментВремени";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		ЗаказОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Попытка
			// Объектная блокировка: если заказ сейчас редактирует пользователь - пропускаем.
			ЗаказОбъект.Заблокировать();
			ЗаказОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт;
			ЗаказОбъект.Комментарий = СокрЛП(ЗаказОбъект.Комментарий + Символы.ПС
				+ СтрШаблон(НСтр("ru = 'Закрыт автоматически %1: истек срок резервирования.'"),
					Формат(ТекущаяДатаСеанса(), "ДЛФ=D")));
			ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Результат.Закрыто = Результат.Закрыто + 1;
		Исключение
			Результат.Ошибок = Результат.Ошибок + 1;
			// Причины отказа проведения приходят сообщениями пользователю - сохраняем их в журнал.
			ЗаписьЖурналаРегистрации(ИмяСобытияЖурнала(), УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Документы.ЗаказКлиента, Выборка.Ссылка,
				ОбщегоНазначения.ЗабратьСообщенияПользователю() + Символы.ПС
					+ ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;

	КонецЦикла;

	ЗаписьЖурналаРегистрации(ИмяСобытияЖурнала(), УровеньЖурналаРегистрации.Информация, , ,
		СтрШаблон(НСтр("ru = 'Закрыто заказов: %1, ошибок: %2'"), Результат.Закрыто, Результат.Ошибок));

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИмяСобытияЖурнала()

	Возврат НСтр("ru = 'Заказы клиентов.Закрытие просроченных заказов'", "ru");

КонецФункции

#КонецОбласти
